#pragma once

/*  

ctrl+shift+左右尖括号<> ： 字体大小

ctrl+H //打开查找替换 /替换查找

ctrl+alt+下 //切换已打开的文档(文本编辑框的右上角下箭头)

ctrl+alt+左 //切换到字体缩放百分比(文本编辑框的左下角百分数)

成员列表提交字符修改
打开vs2019：（依次点击）工具–>选项–>文本编辑器–>C/C++ –>高级–>成员列表提交字符–> 增加需要的符号或删除不需要的符号
//已使用:删除域作用限定符冒号,防止std::launch时自动提交不需要的片段.

禁用红波浪线警告
调试-----选项-----文本编辑器-----C/C++（可根据情况做修改）------高级------禁用波浪曲线 将 “false” 改为 “true” 即可

ctrl+空格  -> 完成单词/自动补全

ctrl + shift +空格 -> 显式参数信息 -- 显式重载的函数等 --- 如果不显示需要可能是输入法冲突了,需要把ctrl+空格切换中英文关闭

ctrl+Home/end -> 转到行首/行尾

选中单词,可通过右键"查找所有的引用"找出使用了该单词的地方 
选中后还可以通过ctrl+shift上下键快速跳到下一个位置

显式函数重载通过上下键切换不同重载函数

双击大纲区域折叠
shift+alt+] 将选定内容扩展到包含块

Ctrl + U  选中代码全部转化为小写 /ctrl +shift + U 全部转成大写


全部隐藏到定义ctrl +M+ O, 全部展开 ctrl +M+L ,单独一个模块展开与切换 ctrl+M+M

同一个括号的左右定位 / 跳转 ctrl + }     //不需要ctrl+{

自动对齐选中代码：Ctrl + k + f  或 alt+F8
自动对齐所有代码：Ctrl + k + d

光标自动跳过单词移动(以独立单位进行左右移动) ctrl + 左右箭头


代码补全：按art + →，按art，然后按方向键右键。会出现代码补全提示


选择单词  ctrl + w

多行同时输入（使用多个光标同时编辑） crtl + alt + 选择行

断点   F9

选中上下移动(默认为光标所在行)  选中alt + 上下

选中块(正方形框选) alt + shift + 方向


活动视图（查看切换打开的活动）  ctrl + tab

剪切行 ctrl + l (和ctrl+X的区别是l剪切后光标在行首,x剪切后光标在原位置)

向上插入行 ctrl + enter

向下插入行 ctrl + shift + enter

智能提示（代码补全，显示注释等）1、ctrl + j  2、alt + →

快速代码块（待学）    VS中输入 ”、 + 选择 + tab“

vs全屏 alt + shift + enter

切换到选项 alt （字母选择生效）   选择 enter

生成:编译不启动 ctrl+B
（shift+F5结束调试）//(Debugging/Debug,又称除错)
调试(逐语句)F11（进函数内部，详细）
调试（逐过程）F10（不进函数，粗略）
调试 (跳出)shift+F9(跳出当前栈帧)


ctrl + G  转到行

ctrl + 上下  光标不动文本框上下移动

ctrl + F6（shift） 回到上一个文件

F12 跳转到定义


调试查看连续指针指向 - （ * 指针 + ，数字），如 * str，5


ctrl + r + w 显式代码前面的空格和制表符,空格表示为点. ,制表符表示为箭头→


*/
