#pragma once


/**
 * 学习一个轮子:
 * 1..分步 要做什么?
 * 
 * 写一个轮子:
 * 耦合,要想到返回值是什么,参数
 * 
 * 
 */



// int b = 1234 ; //则b&1的意思是:将前31位清0,再取最后1位

//不能随意使用引用
/**
 * $ 因为引用很好用,容易习惯性使用引用,有些对象是不支持引用
 * 
 * $ 使用引用前必须确定,引用的对象需要被修改.如果不能修改则不能使用引用.
 * 
 * $ 常量不允许引用
 * 
 * 
 */

//typeid()
/**
 * 可以查看变量的类型
 * 
 */



//原理是不变的知识 -- 1.可以解释历史知识  2.可以预测未来


//一生二,二生三,三生万物
//机器码生汇编，汇编生 C，C 生万物。
/**
 * 学习学第一遍,了解了基本原理,能够回忆起
 * 第二轮运用,局部应用,能够有一定的掌握
 * 第三轮,在前面基础上,局部向全局扩展,逐步掌握总体脉络 --- 具有独立扩展能力,
 * ...
 * 
 * 
 * 
 */


 /**
  * while可以看作if的递归 -- 作用:保证处理任务之后,依旧是满足条件的,才能break
  * if(条件)
  * {
  *     //处理任务...
  *     if(条件)
  *     {
  *         //处理任务...
  *         if()
  *         {
  *             //...
  *             
  *         }
  *     }
  * }
  *  
  * 
  */





