#pragma once


//实现某功能
/**
 * 先描述所有应用此功能的场景
 * .
 */

//空间利用率
/**
 * 
 * 
 * 追求效率而空间浪费过多
 * 
 * .
 */

//时间效率
/**
 * 循环次数是否有限个，有限个则为n(1)
 * 
 * 空间换时间
 * 
 */





//一些算法
/**
 * BF暴力匹配match ,还有KMP(纸老虎) , BM(最实用)
 * 
 * .
 */

//一些语法问题
/**
 * 1.while迭代的问题
 * 迭代前看循环能不能进去,我们主要思维和逻辑都在循环体内,单往往特殊情况是循环没进去,如果前置条件没处理好的话就会出问题
 * 例:BST的erase
 * 
 * 2.if-else问题
 * 如果if内带了return,那么下一句else可加可不加.
 * $ 但如果if内没有return之类,则就要考虑else
 * a.如果else内容是必须执行的,则可以不加else
 * b.如果else内容是和if互斥的,则必须加eles
 * $ 一般以并列排斥为同一组ifelse
 * 
 */
